In [ ]:
"""10:00 / 32:05"""

In [3]:
import pandas as pd

df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4   Rashid       Siwan    NaN
5    Harry      Ranchi   93.0
6     Amit     Kolkata   15.0
7    Ahmed       Delhi   14.0
8  Raheman      Mumbai   34.0
9    Hafiz       Delhi    NaN